Design Fixes, Recommendation Section added
